app/controllers/acc_accounts_controller.rb

SELECT "acc_accounts".* FROM "acc_accounts" WHERE (acc_accounts.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      acc_accounts = AccAccount.search_box(params[:search_text],current_user.id).with_active.get_json_acc_accounts
    else
      acc_accounts = AccAccount.search(params,current_user.id).with_active.get_json_acc_accounts

SELECT "acc_accounts".* FROM "acc_accounts" WHERE (acc_accounts.sales_user_id = 2 AND acc_accounts.is_active = 't')
---
    def set_acc_account
      @acc_account = AccAccount.find(params[:id])