app/controllers/accounts_controller.rb

  def get_marketplaces
    render status: 200, json: { marketplace: Marketplace.all }
---
SELECT "marketplaces".* FROM "marketplaces"

  def disconnect_account
    if @account.update_attributes(state: nil, is_connected: false)
---
UPDATE "accounts" SET "state" = $1, "is_connected" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["state", nil], ["is_connected", "f"], ["updated_at", "2017-09-15 07:33:16.569125"], ["id", 5]]

    def set_contact
      @account = current_user.accounts.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 5]]