app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE (categories.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      categories = Category.search_box(params[:search_text], current_user.id).with_active.get_json_categories
    else
      categories = Category.search(params,current_user.id).with_active.get_json_categories

SELECT "categories".* FROM "categories" WHERE (categories.sales_user_id = 2 AND categories.is_active = 't')
---
    def set_category
      @category = Category.find(params[:id])