app/controllers/cheque_registers_controller.rb

SELECT "cheque_registers".* FROM "cheque_registers" WHERE (cheque_registers.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      cheque_registers = ChequeRegister.search_box(params[:search_text],current_user.id).with_active.get_json_cheque_registers
    else
      cheque_registers = ChequeRegister.search(params,current_user.id).with_active.get_json_cheque_registers