app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE (contacts.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      contacts = Contact.search_box(params[:search_text],current_user.id).with_active.get_json_contacts
    else
      contacts = Contact.search(params,current_user.id).with_active.get_json_contacts