app/controllers/customers_controller.rb

  def index
    if params[:search_text].present?
      customers = Customer.search_box(params[:search_text],current_user.id).with_active.get_json_customers
    else
      customers = Customer.search(params,current_user.id).with_active.get_json_customers
---
SELECT "customers".* FROM "customers" WHERE (customers.sales_user_id = 2) AND (is_active = 't')

  def create
    user = User.new(customer_params)
    user.customer.sales_user_id = current_user.id
    if user.save
---
INSERT INTO "customers" ("customer_since", "phone", "c_type", "street", "city", "state", "country", "postal_code", "decription", "sales_user_id", "user_id", "created_at", "updated_at", "created_by_id", "updated_by_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "users" ("first_name", "email", "role", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"