app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE (employees.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      employees = Employee.search_box(params[:search_text],current_user.id).with_active.get_json_employees
    else
      employees = Employee.search(params,current_user.id).with_active.get_json_employees