app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (expenses.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      expenses = Expense.search_box(params[:search_text],current_user.id).with_active.get_json_expenses
    else
      expenses = Expense.search(params,current_user.id).with_active.get_json_expenses