app/controllers/integration_custom_actions_controller.rb

    def set_current_integration
      @current_integration ||= current_user.accounts.where(id: @account_id).first.try(:integration)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2  ORDER BY "accounts"."id" ASC LIMIT 1  [["user_id", 2], ["id", 7]]