app/controllers/inventory_management_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "inventory_items".* FROM "inventory_items"
---
	def get_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@inventory_items = InventoryItem.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "inventory_items" ("icc", "serial", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["icc", "test icc"], ["serial", "test serial"], ["created_at", "2017-10-21 03:56:56.855300"], ["updated_at", "2017-10-21 03:56:56.855300"]]
---
	def create_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			if @user.is_admin?
				@inventory_item = InventoryItem.create(inventory_item_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@inventory_item = InventoryItem.find_by(id: params[:inventory_item_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "inventory_items" SET "icc" = $1, "serial" = $2, "updated_at" = $3 WHERE "inventory_items"."id" = $4  [["icc", "test llll"], ["serial", "test sdsd"], ["updated_at", "2017-10-21 04:45:18.889894"], ["id", 1]]
---
	def edit_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			if @user.is_admin?
				@inventory_item = InventoryItem.find_by(id: params[:inventory_item_id])
				@inventory_item.update_attributes(inventory_item_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "inventory_items" WHERE "inventory_items"."id" = $1  [["id", 1]]
---
	def delete_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			if @user.is_admin?
				@split_id = params[:inventory_item_id]
				@inventory_item_ids = @split_id.split(',')
				if @inventory_item_ids.present?
					begin
						@inventory_item_ids.each do |id|
							@inventory_item = InventoryItem.find(id)
							if @inventory_item.present?
								@inventory_item.delete

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "inventory_items".* FROM "inventory_items" WHERE (icc LIKE 'text_serial_31' OR serial LIKE 'text_serial_31' OR make LIKE 'text_serial_31' OR model LIKE 'text_serial_31' OR location LIKE 'text_serial_31')
SELECT "inventory_items".* FROM "inventory_items" WHERE "inventory_items"."id" = $1  [["id", 2]]
---
	def search_inventory_item
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			array_search = []
			if params[:search_inventory_item].present?
				search_text = params[:search_inventory_item][:search_box]
	      if search_text.present?
	      	search = (search_text).match(/^(\d)+$/).to_s
	      	if search.present?
	        	search_id = InventoryItem.where(id: search)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1  [["user_id", 1]]
---
	def get_listing
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@listings = @user.try(:listings)
			if @listings.present?

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "listings" ("item_category_id", "title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_category_id", 2], ["title", "test tittle"], ["user_id", 1], ["created_at", "2017-10-21 03:43:03.787815"], ["updated_at", "2017-10-21 03:43:03.787815"]]
---
	def create_listing
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@listing = @user.listings.create(listings_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "listings".* FROM "listings" WHERE "listings"."user_id" = $1 AND "listings"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]
---
	def show_listing
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@listing = @user.try(:listings).find_by(id: params[:listing_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 2]]
---
	def delete_listing
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@split_id = params[:listing_id]
			@listing_id = @split_id.split(',')
			if @listing_id.present?
				begin
					@listing_id.each do |id|
						@listing = Listing.find(id)
						if @listing.present?
							@listing.delete

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "listings".* FROM "listings" WHERE (title LIKE 'description_1' OR make LIKE 'description_1' OR model LIKE 'description_1' OR description LIKE 'description_1')
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]
---
	def search_listing
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			array_search = []
			if params[:search_listing].present?
	      if params[:search_listing][:search_box].present?
					search_text = params[:search_listing][:search_box]
	      	search = (search_text).match(/^(\d)+$/).to_s
	      	if search.present?
	        	search_id = Listing.where(id: search)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "item_sources".* FROM "item_sources"
---
	def get_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@item_sources = ItemSource.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "item_sources" ("name", "short_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "2"], ["short_name", "test tittle"], ["created_at", "2017-10-21 03:52:38.625143"], ["updated_at", "2017-10-21 03:52:38.625143"]]
---
	def create_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@user.is_admin?
			if @user.is_admin?
				@item_source = ItemSource.create(item_source_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "item_sources".* FROM "item_sources" WHERE "item_sources"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@item_source = ItemSource.find_by(id: params[:item_source_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "item_sources".* FROM "item_sources" WHERE "item_sources"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "item_sources" SET "name" = $1, "updated_at" = $2 WHERE "item_sources"."id" = $3  [["name", "kkk"], ["updated_at", "2017-10-22 13:02:29.182263"], ["id", 1]]
---
	def edit_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			if @user.is_admin?
				@item_source = ItemSource.find_by(id: params[:item_source_id])
				@item_source.update_attributes(item_source_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "item_sources".* FROM "item_sources" WHERE "item_sources"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "item_sources" WHERE "item_sources"."id" = $1  [["id", 1]]
---
	def delete_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			if @user.is_admin?
				@split_id = params[:item_source_id]
				@item_source_id = @split_id.split(',')
				if @item_source_id.present?
					begin
						@item_source_id.each do |id|
							@item_source = ItemSource.find(id.to_i)
							if @item_source.present?
								@item_source.delete

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "item_sources".* FROM "item_sources" WHERE (name LIKE 'test_name' OR short_name LIKE 'test_name')
SELECT "item_sources".* FROM "item_sources" WHERE "item_sources"."id" = $1  [["id", 2]]
---
	def search_item_source
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			array_search = []
			if params[:search_item_source].present?
	      if params[:search_item_source][:search_box].present?
					search_text = params[:search_item_source][:search_box]
	      	search = (search_text).match(/^(\d)+$/).to_s
	      	if search.present?
		        search_id = ItemSource.where(id: search)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "item_categories".* FROM "item_categories"
---
	def get_item_category
		if params[:user_id].present?
			@user = User.find_by(id: params[:user_id])
			@item_category = ItemCategory.all