app/controllers/items_controller.rb

  def index
    if params[:search_text].present?
      items = Item.search_box(params[:search_text],current_user.id).with_active.get_json_items
    else
      items = Item.search(params,current_user.id).with_active.get_json_items
---
SELECT "items".* FROM "items" WHERE (items.sales_user_id = 2) AND (is_active = 't')

    def set_item
      @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE (items.sales_user_id = 2) AND (is_active = 't') AND "items"."id" = $1 LIMIT 1  [["id", 1]]