app/controllers/ledger_entries_controller.rb

SELECT "ledger_entries".* FROM "ledger_entries" WHERE (ledger_entries.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      ledger_entries = LedgerEntry.search_box(params[:search_text],current_user.id).with_active.get_json_ledger_entries
    else
      ledger_entries = LedgerEntry.search(params,current_user.id).with_active.get_json_ledger_entries