app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE (notes.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      notes = Note.search_box(params[:search_text],current_user.id).with_active.get_json_notes
    else
      notes = Note.search(params,current_user.id).with_active.get_json_notes