app/controllers/payrolls_controller.rb

SELECT "payrolls".* FROM "payrolls" WHERE (payrolls.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      payrolls = Payroll.search_box(params[:search_text],current_user.id).with_active.get_json_payrolls
    else
      payrolls = Payroll.search(params,current_user.id).with_active.get_json_payrolls