app/controllers/report_sales_controller.rb

SELECT "sales_orders".* FROM "sales_orders" INNER JOIN "accounts" ON "accounts"."id" = "sales_orders"."account_id" INNER JOIN "marketplaces" ON "marketplaces"."id" = "accounts"."marketplace_id" WHERE (sales_orders.sales_user_id = 2) AND (marketplaces.name IN ('Etsy','Amazon','eBay','Shopify'))  ORDER BY COALESCE(create_timestamp, sales_orders.created_at) DESC
---
  def index
      filter = ['Etsy','Amazon','eBay','Shopify']
      @orders = SalesOrder.where("sales_orders.sales_user_id = ?",current_user.id)
      @orders = @orders.order('COALESCE(create_timestamp, sales_orders.created_at) DESC')
      if params[:filter].present?
        @orders = @orders.joins(:account => :marketplace).where('marketplaces.name = ?', params[:filter])