app/controllers/sales_orders_controller.rb

    def create_sales_order
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        @sales_order = SalesOrder.create(sales_order_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "sales_orders" ("customer_user_id", "contact_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["customer_user_id", 2], ["contact_user_id", 2], ["created_at", "2017-11-20 03:26:18.148298"], ["updated_at", "2017-11-20 03:26:18.148298"]]

    def index
      if params[:search_text].present?
        sales_orders = SalesOrder.search_box(params[:search_text],current_user.id).get_json_sales_orders
      else
        sales_orders = SalesOrder.search(params,current_user.id,false).get_json_sales_orders
---
SELECT "sales_orders".* FROM "sales_orders" WHERE (sales_orders.sales_user_id = 2)

    def search_sales_orders
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        array_search = []
        if params[:search_sales_orders].present?
          sales_order_id = params[:search_sales_orders][:id]
          search_id = SalesOrder.where(id: sales_order_id.to_i) if sales_order_id.present?
          array_search << search_id
          sales_order_uid = params[:search_sales_orders][:uid]
          search_name = SalesOrder.where(uid: sales_order_uid.to_i) if sales_order_uid.present?
          array_search << search_name
          sales_order_contact_user_id = params[:search_sales_orders][:contact_user_id]
          search_name_user_id = SalesOrder.where(contact_user_id: sales_order_contact_user_id.to_i) if sales_order_contact_user_id.present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1  [["id", 1]]
SELECT "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."contact_user_id" = $1  [["contact_user_id", 2]]

    def sales_order_delete
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        @split_id = params[:sales_order_id]
        @sales_order_id = @split_id.split(',')
        if @sales_order_id.present?
          begin
            @sales_order_id.each do |id|
              @sales_order = SalesOrder.find(id)
              if @sales_order.present?
                @sales_order.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "sales_orders" WHERE "sales_orders"."id" = $1  [["id", 2]]

    def view_sales_orders
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        @sales_order = SalesOrder.find(params[:sales_order_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 1]]

    def edit_sales_orders
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        @sales_order = SalesOrder.find_by(id: params[:sales_order_id])
        if @sales_order.present?
          @sales_order.update_attributes(sales_order_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "sales_orders" SET "uid" = $1, "updated_at" = $2 WHERE "sales_orders"."id" = $3  [["uid", "2323"], ["updated_at", "2017-11-21 10:15:49.394403"], ["id", 1]]

    def get_sales_orders
      if params[:user_id].present?
        @user = User.find_by(id: params[:user_id])
        @sales_order = SalesOrder.where(sales_user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "sales_orders".* FROM "sales_orders" WHERE (sales_orders.sales_user_id = 2 AND sales_orders.is_active = 't')