app/controllers/sales_order_invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE (invoices.sales_user_id = 2)
---
    def index
      if params[:search_text].present?
        invoices = Invoice.search_box(params[:search_text],current_user.id).get_json_invoices
      else
        invoices = Invoice.search(params,current_user.id,true).get_json_invoices

SELECT "invoices".* FROM "invoices" WHERE (invoices.sales_user_id = 2 AND invoices.is_active = 't')
---
      def set_invoice
        @invoice = Invoice.find(params[:id])