app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers" WHERE (suppliers.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      suppliers = Supplier.search_box(params[:search_text],current_user.id).with_active.get_json_suppliers
    else
      suppliers = Supplier.search(params,current_user.id).with_active.get_json_suppliers

SELECT "suppliers".* FROM "suppliers" WHERE (suppliers.sales_user_id = 2 AND suppliers.is_active = 't')
---
    def set_supplier
      @supplier = Supplier.find(params[:id])