app/controllers/timeclocks_controller.rb

SELECT "timeclocks".* FROM "timeclocks" WHERE (timeclocks.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      timeclocks = Timeclock.search_box(params[:search_text],current_user.id).with_active.get_json_timeclocks
    else
      timeclocks = Timeclock.search(params,current_user.id).with_active.get_json_timeclocks