app/controllers/warehouses_controller.rb

SELECT "warehouses".* FROM "warehouses" WHERE (warehouses.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      warehouses = Warehouse.search_box(params[:search_text],current_user.id).with_active.get_json_warehouses
    else
      warehouses = Warehouse.search(params,current_user.id).with_active.get_json_warehouses