app/controllers/warehouse_locations_controller.rb

SELECT "warehouse_locations".* FROM "warehouse_locations" WHERE (warehouse_locations.sales_user_id = 2) AND (is_active = 't')
---
  def index
    if params[:search_text].present?
      warehouse_locations = WarehouseLocation.search_box(params[:search_text],current_user.id).with_active.get_json_warehouse_locations
    else
      warehouse_locations = WarehouseLocation.search(params,current_user.id).with_active.get_json_warehouse_locations

SELECT  "warehouse_locations".* FROM "warehouse_locations" WHERE "warehouse_locations"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_warehouse_location
      @warehouse_location = WarehouseLocation.find(params[:id])