app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("role", "email", "first_name", "last_name", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    user = User.new(user_params)
    p 111111111111111111111111111
    p 'user.errors'
    p user.errors
      p 'user.confirm'
      p user.confirm
      render :json=> {:status => true,:message => "User created!", :user => user }, :status=>200
    if user.save